app/controllers/markers_controller.rb

	def create
		@marker = Marker.new(article_params)
  		@marker.save
---
INSERT INTO "markers" ("name", "location", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "noodle place"], ["location", "reykjavik"], ["details", "really good noodles!"], ["created_at", "2018-01-10 02:05:05.773679"], ["updated_at", "2018-01-10 02:05:05.773679"]]